#俺ら東京さ行ぐだ
#作詞・作曲・歌手：吉幾三
#1984年（昭和59年）11月25日発表
#python3コーデ：グール
#俺ら東京さ行ぐだv1.07.py
#巡査のパトロールは3/日と仮定する
#[課題]自動車の「それほど」の解がわからず今回は「無い」と仮定
import datetime

def 俺ら東京さ行ぐだ歌詞():
    テレビ = str()
    ラジオ = str()
    自動車 = str()
    ピアノ = str()
    バー = str() 
    _巡査 = "巡査"
    パトロール = 3

    村 = [テレビ, ラジオ, 自動車, ピアノ, バー]
    del 村[0:4]
    print("村 =", 村, "♪")

    パトロール回数 = 0
    while パトロール回数 < パトロール:        
        パトロール回数 = パトロール回数 + 1
        print(_巡査, "パトロール", パトロール回数, "回目")

        if パトロール回数 == パトロール:
            print("ぐーるぐる♪")
            print("俺らこんな村いやだ～♪")

def 歌う():
    時間１ = datetime.datetime.now()
    俺ら東京さ行ぐだ歌詞()
    時間２ = datetime.datetime.now()

    執行時間＿秒 = 時間２ - 時間１
    print("執行時間（秒（マイクロ秒まで可））：", 執行時間＿秒.total_seconds(), "時間２：", 時間２, "時間１：", 時間１)

if __name__ == '__main__': 
    歌う()

